In [1]:
#Data Cleaning and Preparation

In [2]:
import numpy as np, pandas as pd

In [3]:
string_data = pd.Series(['aardvark','artichoke', np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]=None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [15]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
cleaned = data[data.notnull()]

In [17]:
cleaned

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
cleaned = data.dropna()

In [19]:
cleaned

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned = data.dropna()

In [23]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [25]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data[4]=NA

In [28]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [29]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data.dropna(axis=0,how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [31]:
import pandas as pd
import numpy as np

In [32]:
df = pd.DataFrame(np.random.randn(7,3))

In [33]:
df

          0         1         2
0 -2.324433  0.433177 -0.604417
1 -1.271289 -0.393171  2.050920
2 -1.002302 -0.153390 -0.036190
3 -1.002361  0.471366 -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [34]:
df.iloc[:4,1]= np.nan

In [35]:
df.iloc[:2,2]= np.nan

In [36]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [37]:
df.dropna(0,how='all')

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [38]:
df.dropna()

          0         1         2
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [39]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [40]:
df.dropna(thresh=1)

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [41]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [42]:
df.dropna(thresh=2)

          0         1         2
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [43]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [44]:
df.dropna(thresh=3)

          0         1         2
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [45]:
#Filling in missing Data

In [46]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [47]:
df.fillna(0)

          0         1         2
0 -2.324433  0.000000  0.000000
1 -1.271289  0.000000  0.000000
2 -1.002302  0.000000 -0.036190
3 -1.002361  0.000000 -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [48]:
df.fillna(99999)

          0             1             2
0 -2.324433  99999.000000  99999.000000
1 -1.271289  99999.000000  99999.000000
2 -1.002302  99999.000000     -0.036190
3 -1.002361  99999.000000     -2.523585
4  0.618015     -0.502621     -1.726214
5 -1.676016      1.005753     -0.369551
6 -0.018379     -0.626303     -1.011610

In [49]:
df.fillna({1:'one',
           2:'two'})

          0         1         2
0 -2.324433       one       two
1 -1.271289       one       two
2 -1.002302       one  -0.03619
3 -1.002361       one -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303  -1.01161

In [50]:
df

          0         1         2
0 -2.324433       NaN       NaN
1 -1.271289       NaN       NaN
2 -1.002302       NaN -0.036190
3 -1.002361       NaN -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [51]:
_ = df.fillna(0, inplace=True)

In [52]:
_

In [53]:
df

          0         1         2
0 -2.324433  0.000000  0.000000
1 -1.271289  0.000000  0.000000
2 -1.002302  0.000000 -0.036190
3 -1.002361  0.000000 -2.523585
4  0.618015 -0.502621 -1.726214
5 -1.676016  1.005753 -0.369551
6 -0.018379 -0.626303 -1.011610

In [54]:
import numpy as np

In [55]:
df= pd.DataFrame(np.random.randint(18, size=(6,3)))

In [56]:
df

    0   1   2
0   4  17   7
1   7  13  13
2   1   3   4
3  11   5   4
4   0  11   0
5   7  17  11

In [57]:
df.iloc[2:,1]=NA

In [58]:
df.iloc[4:,2]=NA

In [59]:
df

    0     1     2
0   4  17.0   7.0
1   7  13.0  13.0
2   1   NaN   4.0
3  11   NaN   4.0
4   0   NaN   NaN
5   7   NaN   NaN

In [60]:
import pandas as pd

In [61]:
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'], 
                     'k2':[1,1,2,3,3,4,4]})

In [62]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [65]:
#Pandas rows and columns extension

In [66]:
import pandas as pd

In [67]:
df = pd.DataFrame({'Region':['West','North','South'],
                   'Company':['Costco','Walmart','Home Depot'],
                   'Product':['Dinner Set','Grocery','Gardening tools'],
                   'Month':['September','July','February'],
                   'Sales':[2500,3096,8795]
                  })

In [68]:
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795

In [69]:
data = [{'Region':'East','Company':'Shop Rite','Product':'Fruits','Month':'December','Sales': 1265}]

In [70]:
df.append(data, ignore_index=True)

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795
3   East   Shop Rite           Fruits   December   1265

In [71]:
df

  Region     Company          Product      Month  Sales
0   West      Costco       Dinner Set  September   2500
1  North     Walmart          Grocery       July   3096
2  South  Home Depot  Gardening tools   February   8795

In [72]:
df=df.append(data, ignore_index=True, sort=True)

In [73]:
df

      Company      Month          Product Region  Sales
0      Costco  September       Dinner Set   West   2500
1     Walmart       July          Grocery  North   3096
2  Home Depot   February  Gardening tools  South   8795
3   Shop Rite   December           Fruits   East   1265

In [74]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [75]:
df.loc[len(df.index)]=list(data[0].values())

In [76]:
df

      Company      Month          Product    Region  Sales
0      Costco  September       Dinner Set      West   2500
1     Walmart       July          Grocery     North   3096
2  Home Depot   February  Gardening tools     South   8795
3   Shop Rite   December           Fruits      East   1265
4        East  Shop Rite           Fruits  December   1265

In [77]:
df.iloc[1]=list(data[0].values())

In [78]:
df

      Company      Month          Product    Region  Sales
0      Costco  September       Dinner Set      West   2500
1        East  Shop Rite           Fruits  December   1265
2  Home Depot   February  Gardening tools     South   8795
3   Shop Rite   December           Fruits      East   1265
4        East  Shop Rite           Fruits  December   1265

In [79]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [80]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [81]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [82]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [83]:
data['v1'] = range(7)

In [84]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [85]:
data.append(['three',2,8])

    k1   k2   v1      0
0  one  1.0  0.0    NaN
1  two  1.0  1.0    NaN
2  one  2.0  2.0    NaN
3  two  3.0  3.0    NaN
4  one  3.0  4.0    NaN
5  two  4.0  5.0    NaN
6  two  4.0  6.0    NaN
0  NaN  NaN  NaN  three
1  NaN  NaN  NaN      2
2  NaN  NaN  NaN      8

In [86]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [87]:
data.append({'k1':'three','k2':2,'v1':1}, ignore_index=True)

      k1  k2  v1
0    one   1   0
1    two   1   1
2    one   2   2
3    two   3   3
4    one   3   4
5    two   4   5
6    two   4   6
7  three   2   1

In [88]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [89]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [90]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [91]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [92]:
data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [93]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [94]:
li=['k1','k2']
da=data
for i in li:
    da=da.drop_duplicates(i)
da

    k1  k2  v1
0  one   1   0

In [95]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [96]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [97]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [98]:
lowercased = data['food'].str.lower()

In [99]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [100]:
data['animal']=lowercased.map(meat_to_animal)

In [101]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [102]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [103]:
#replacing values

In [104]:
data = pd.Series([1., -999., 2, -999, -1000, 3])

In [105]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [106]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [107]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [108]:
data.replace({-999:'nine nine nine', -1000:'one thousand'})

0               1.0
1    nine nine nine
2               2.0
3    nine nine nine
4      one thousand
5               3.0
dtype: object

In [109]:
#Renaming Axis Indexes

In [110]:
data = pd.DataFrame(data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                                        index=['Ohio', 'Colorado', 'New York'],
                                        columns=['one', 'two', 'three', 'four']))

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [112]:
transform= lambda x: x[:4].upper()

In [113]:
data.index=data.index.map(transform)

In [114]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [115]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekabo'})

         one  two  peekabo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [116]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [117]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekabo'}, inplace=True)

In [118]:
data

         one  two  peekabo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [119]:
#Discretization and Binning

In [120]:
ages = [18,22,25,27,21,23,37,31,61,45,41,32]

In [121]:
bins = [18,25,35,60,100]

In [122]:
cats = pd.cut(ages, bins)

In [123]:
cats

[NaN, (18.0, 25.0], (18.0, 25.0], (25.0, 35.0], (18.0, 25.0], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [124]:
len(ages)

12

In [125]:
cats.codes

array([-1,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1], dtype=int8)

In [126]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [127]:
pd.value_counts(cats)

(18, 25]     4
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [128]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [129]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [130]:
pd.cut(ages, bins, labels=group_names)

[NaN, 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [131]:
data = pd.Series([9,20,15,14,20,30,25,20])

In [132]:
data

0     9
1    20
2    15
3    14
4    20
5    30
6    25
7    20
dtype: int64

In [133]:
pd.cut(data,4)

0    (8.979, 14.25]
1     (19.5, 24.75]
2     (14.25, 19.5]
3    (8.979, 14.25]
4     (19.5, 24.75]
5     (24.75, 30.0]
6     (24.75, 30.0]
7     (19.5, 24.75]
dtype: category
Categories (4, interval[float64]): [(8.979, 14.25] < (14.25, 19.5] < (19.5, 24.75] < (24.75, 30.0]]

In [134]:
a=[i for i in range(16)]

In [135]:
a

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

In [136]:
anp = np.array(a)

In [137]:
anp

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [138]:
cats = pd.qcut(anp,4)

In [139]:
cats

[(-0.001, 3.75], (-0.001, 3.75], (-0.001, 3.75], (-0.001, 3.75], (3.75, 7.5], ..., (7.5, 11.25], (11.25, 15.0], (11.25, 15.0], (11.25, 15.0], (11.25, 15.0]]
Length: 16
Categories (4, interval[float64]): [(-0.001, 3.75] < (3.75, 7.5] < (7.5, 11.25] < (11.25, 15.0]]

In [140]:
pd.value_counts(cats)

(-0.001, 3.75]    4
(3.75, 7.5]       4
(7.5, 11.25]      4
(11.25, 15.0]     4
dtype: int64

In [141]:
#Detecting and filtering Outliers

In [142]:
import pandas as pd, numpy as np

In [143]:
data = pd.DataFrame(np.random.randn(1000,4))

In [144]:
data

            0         1         2         3
0   -1.195775  1.061845  0.928523  1.523723
1    0.221534  1.992309 -0.222802 -0.751626
2    0.690220 -0.081557  1.051931  1.737352
3    0.296856  0.490291  5.178080  1.014890
4   -1.316436 -0.568105  0.411658  0.052961
..        ...       ...       ...       ...
995  0.445241  1.098327 -0.219767 -0.533635
996 -2.738608 -0.256423 -0.217648 -0.077451
997  0.571698 -1.156772 -0.380947 -0.334179
998  1.131620 -2.358293 -1.537639 -1.745886
999  0.008480 -2.268211 -0.594663 -0.115003

[1000 rows x 4 columns]

In [145]:
data.to_csv('june2.csv')

In [146]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.048610    -0.035522     0.018341    -0.000314
std       1.009302     1.041133     1.031400     1.006138
min      -3.629480    -4.070997    -3.829592    -3.196559
25%      -0.586706    -0.716019    -0.650594    -0.688861
50%       0.030876    -0.040472     0.033906    -0.012021
75%       0.696101     0.677908     0.698172     0.717202
max       3.603467     3.097228     5.178080     2.884038

In [147]:
col = data[2]

In [148]:
col

0      0.928523
1     -0.222802
2      1.051931
3      5.178080
4      0.411658
         ...
995   -0.219767
996   -0.217648
997   -0.380947
998   -1.537639
999   -0.594663
Name: 2, Length: 1000, dtype: float64

In [149]:
[np.abs(col)>3]

[0      False
 1      False
 2      False
 3       True
 4      False
        ...
 995    False
 996    False
 997    False
 998    False
 999    False
 Name: 2, Length: 1000, dtype: bool]

In [150]:
a=col[np.abs(col)>2]=np.nan

In [151]:
a

nan

In [152]:
data[2].replace({np.abs(col)>2:-.05})

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [ ]:
#Detecting and filtering outliers

In [153]:
data = pd.DataFrame(np.random.randn(1000,4))

In [154]:
data

            0         1         2         3
0   -0.808728 -1.255034 -0.252365  0.523992
1   -0.415170 -0.439862 -0.358393 -0.597833
2   -0.190947 -0.279249  1.826779 -0.142585
3   -0.679736 -0.871500  0.299255  1.535364
4    0.906253  0.410283  0.793307 -0.630705
..        ...       ...       ...       ...
995  1.014017 -0.323889 -0.311465 -0.455608
996 -1.382851 -0.314726  0.198744  1.011723
997 -1.026551 -0.600895 -0.452353 -0.419420
998  0.863051  0.122336  0.289954  0.016163
999 -1.210856  0.505761 -0.058867 -0.270848

[1000 rows x 4 columns]

In [155]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007018    -0.037065    -0.057385    -0.061749
std       0.995383     1.015781     1.027555     0.984535
min      -3.192788    -3.127077    -3.479661    -2.835599
25%      -0.662797    -0.740519    -0.765786    -0.718224
50%       0.002437    -0.034957    -0.087813    -0.094086
75%       0.668375     0.621466     0.650690     0.582799
max       2.811826     3.558686     3.796666     3.074495

In [156]:
col = data[2]

In [157]:
col

0     -0.252365
1     -0.358393
2      1.826779
3      0.299255
4      0.793307
         ...
995   -0.311465
996    0.198744
997   -0.452353
998    0.289954
999   -0.058867
Name: 2, Length: 1000, dtype: float64

In [158]:
col.describe()

count    1000.000000
mean       -0.057385
std         1.027555
min        -3.479661
25%        -0.765786
50%        -0.087813
75%         0.650690
max         3.796666
Name: 2, dtype: float64

In [159]:
col[np.abs(col)>3]

63    -3.168300
632   -3.479661
681    3.096487
798    3.796666
893    3.044999
Name: 2, dtype: float64

In [161]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
7    0.168424 -1.127528  0.375344  3.074495
63  -1.132498 -0.944572 -3.168300 -1.837774
128 -3.192788 -0.508939 -1.777517 -0.957702
185 -3.036084  0.354618  0.724212 -0.728136
219  0.158406 -3.127077  0.627311  0.152082
377 -0.395856  3.558686 -0.149955  1.230507
632  1.194878 -1.093382 -3.479661  0.366798
681  0.626997  1.168416  3.096487 -1.009800
695  0.186294  3.377541  0.423803  0.270347
734  0.914958  3.090080 -0.408683  1.265227
798 -1.372261  0.498208  3.796666 -0.150638
893 -0.031690 -1.137765  3.044999 -0.828136

In [163]:
data[np.abs(data)>3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [164]:
#Permutation and random sampling

In [165]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [166]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [168]:
sampler = np.random.permutation(df)

In [169]:
sampler

array([[ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [16, 17, 18, 19],
       [12, 13, 14, 15],
       [ 4,  5,  6,  7]])

In [170]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [171]:
sampler = np.random.permutation(0)

In [172]:
sampler

array([], dtype=int64)

In [177]:
sampler = np.random.permutation(10)

In [178]:
sampler

array([6, 7, 0, 9, 1, 8, 2, 5, 4, 3])

In [179]:
sampler = np.random.permutation(df)

In [180]:
sampler

array([[12, 13, 14, 15],
       [ 4,  5,  6,  7],
       [16, 17, 18, 19],
       [ 0,  1,  2,  3],
       [ 8,  9, 10, 11]])

In [185]:
df.take(np.random.permutation(5))

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [186]:
df.take([0,2,1,3,4])

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [187]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [188]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [189]:
choices = pd.Series([5,7,-1,6,4])

In [190]:
draws = choices.sample(n=10, replace = True)

In [191]:
draws = choices.sample(n=10)

ValueError: Cannot take a larger sample than population when 'replace=False'

In [6]:
import numpy as np, pandas as pd

In [7]:
data = {'Dave': 'dave@google.com', 
        'Steve': 'steve@gmail.com', 'Rob':'rob@gmail.com',
        'Wes':np.nan
       }

In [8]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [10]:
data = pd.Series(data)

In [11]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [12]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [13]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [14]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [16]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [17]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [22]:
import re

In [23]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object